{
  "Home": {
    "title": "Welcome to arolariu.ro",
    "subtitle": "This platform was built by Alexandru-Razvan Olariu as a playground for new technologies. The platform is built using state-of-the-art, enterprise-grade technologies. <br> </br> <br> </br> You are welcome to explore all of the applications and services that are hosted on this domain space.",
    "appreciation": "THANK YOU FOR THE TIME SPENT ON THE WEBSITE."
  },
  "termsOfService": {
    "title": "Terms of Service",
    "last_updated": "Last updated: 2024-01-01",
    "terms": {
      "generalTerms": {
        "title": "General Terms",
        "content": "By accessing and placing an order with AROLARIU.RO, you confirm that you are in agreement with and bound by the terms of service contained in the Terms & Conditions outlined below. These terms apply to the entire website and any email or other type of communication between you and AROLARIU.RO. Under no circumstances shall AROLARIU.RO team be liable for any direct, indirect, special, incidental or consequential damages, including, but not limited to, loss of data or profit, arising out of the use, or the inability to use, the materials on this site, even if AROLARIU.RO team or an authorized representative has been advised of the possibility of such damages. If your use of materials from this site results in the need for servicing, repair or correction of equipment or data, you assume any costs thereof. AROLARIU.RO will not be responsible for any outcome that may occur during the course of usage of our resources. We reserve the rights to change prices and revise the resources usage policy in any moment."
      },
      "licenseTerms": {
        "title": "License Terms",
        "content": "By purchasing a product of AROLARIU.RO, you are granted a non-exclusive, non-transferable license to access the product. The product is for personal and commercial use. You are allowed to install the product on more than one computer or device, but you are not allowed to share the product with other individuals. You may not modify, adapt, translate, reverse engineer, decompile, disassemble or create derivative works based on the product without the prior written consent of AROLARIU.RO. You may not sell, rent, lease, or sublicense the product. You may not make the product available over a network where it could be used by multiple devices at the same time. You may not use the product to infringe on any copyright or trademark. You may not use the product to create any material that is unlawful, harmful, threatening, abusive, harassing, tortious, defamatory, vulgar, obscene, libelous, invasive of another's privacy, hateful, or racially, ethnically or otherwise objectionable."
      },
      "definitionTerms": {
        "title": "Definitions",
        "content": "The terms 'us' or 'we' or 'our' refers to AROLARIU.RO, the owner of the website. A customer is the person or organization that buys or agrees to buy the product. Our 'product' refers to the website, products, or services offered for sale on our website. A 'user' is a person who uses our website or services. The term 'you' refers to the user or viewer of our website."
      },
      "restrictionTerms": {
        "title": "Restrictions",
        "content": "You are specifically restricted from publishing, selling, sublicensing, or otherwise commercializing any website material; using this website in any way that is or may be damaging to this website; using this website in any way that impacts user access to this website; using this website contrary to applicable laws and regulations, or in any way may cause harm to the website, or to any person or business entity; engaging in any data mining, data harvesting, data extracting or any other similar activity in relation to this website; using this website to engage in any advertising or marketing."
      },
      "consentTerms": {
        "title": "Your Consent",
        "content": "We've updated our Terms & Conditions to provide you with complete transparency into what is being set when you visit our site and how it's being used. By using our website, you hereby consent to our Terms of Service and agree to the Terms & Conditions."
      },
      "linksToOtherSitesTerms": {
        "title": "Links to Other Websites",
        "content": "Our service may contain links to other websites that are not operated by Us. If you click on a third party link, you will be directed to that third party's site. We strongly advise you to review the Terms & Conditions of every site that you visit. We have no control over and assume no responsibility for the content, Terms & Conditions or practices of any third party sites or services."
      },
      "cookiesTerms": {
        "title": "Cookies",
        "content": "We use 'Cookies' to identify the areas of our website that you have visited. A Cookie is a small piece of data stored on your computer or mobile device by your web browser. We use Cookies to enhance the performance and functionality of our service but are non-essential to their use. However, without these cookies, certain functionality like videos may become unavailable or you would be required to enter your login details every time you visit our platform as we would not be able to remember that you had logged in previously. Most web browsers can be set to disable the use of Cookies. However, if you disable Cookies, you may not be able to access functionality on our website correctly or at all. We never place Personally Identifiable Information in Cookies."
      },
      "changesToTos": {
        "title": "Changes to Terms of Service",
        "content": "AROLARIU.RO reserves the right to change these Terms of Service at any time. We do, however, recommend that you read this page regularly to ensure that you are aware of any changes. Your continued use of the website following the posting of changes will mean that you accept and agree to the changes. You acknowledge and agree that we may stop (permanently or temporarily) providing the Service (or any features within the Service) to you or to users generally at our sole discretion, without prior notice to you. You may stop using the Service at any time. You do not need to specifically inform us when you stop using the Service. You acknowledge and agree that if we disable access to your account, you may be prevented from accessing the Service, your account details or any files or other materials which is contained in your account"
      },
      "updateOfServicesTerms": {
        "title": "Updates to the Service",
        "content": "AROLARIU.RO is constantly updating its services, which means that we may add or remove features, products, or functionalities, and we may also suspend or stop the service altogether. We may take any of these actions at any time, and when we do, we may not provide you with any notice beforehand. You acknowledge that AROLARIU.RO may establish general practices and limits concerning use of the service, including without limitation the maximum period of time that data or other content will be retained by the service and the maximum storage space that will be allotted on AROLARIU.RO's servers on your behalf. You agree that AROLARIU.RO has no responsibility or liability for the deletion or failure to store any data or other content maintained or uploaded by the service. You acknowledge that AROLARIU.RO reserves the right to terminate accounts that are inactive for an extended period of time. You agree that we have no obligation to (i) provide any Updates, or (ii) continue to provide or enable any particular features and/or functionalities of the service to you. You further agree that all Updates will be (i) deemed to constitute an integral part of the service, and (ii) subject to the terms and conditions of this Agreement."
      },
      "thirdPartyTerms": {
        "title": "Third Party Services",
        "content": "In using the service, you may use third-party services, products, software, embeds, or applications developed by a third party ('Third Party Services'). Any use of a Third Party Service is at your own risk, and we shall not be responsible or liable to anyone for Third Party websites or Services. You acknowledge and agree that we shall not be responsible or liable for any damage or loss caused or alleged to be caused by or in connection with the use of any such content, goods or services available on or through any such websites or services. We do not assume and shall not have any liability or responsibility to you or any other person or entity for any Third-Party Services. Third-Party Services and links therefore are provided solely as a convenience to you and you access and use them entirely at your own risk and subject to such third parties' terms and conditions."
      },
      "terminationTerms": {
        "title": "Termination",
        "content": "We may terminate or suspend your account and bar access to the service immediately, without prior notice or liability, under our sole discretion, for any reason whatsoever and without limitation, including but not limited to a breach of the Terms. If you wish to terminate your account, you may simply discontinue using the service. All provisions of the Terms which by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity and limitations of liability."
      },
      "copyrightTerms": {
        "title": "Copyright Protection",
        "content": "If you are a copyright owner or such owner’s agent and believe any material from us constitutes an infringement on your copyright, please contact us setting forth the following information: (a) a physical or electronic signature of the copyright owner or a person authorized to act on his behalf; (b) identification of the material that is claimed to be infringing; (c) your contact information, including your address, telephone number, and an email; (d) a statement by you that you have a good faith belief that use of the material is not authorized by the copyright owners; and (e) the a statement that the information in the notification is accurate, and, under penalty of perjury you are authorized to act on behalf of the owner."
      },
      "noWarrantiesTerms": {
        "title": "No Warranties",
        "content": "This website is provided 'as is,' with all faults, and AROLARIU.RO makes no express or implied representations or warranties, of any kind related to this website or the materials contained on this website. Additionally, nothing contained on this website shall be construed as providing consult or advice to you. The service is provided to you 'AS IS' and 'AS AVAILABLE' and with all faults and defects without warranty of any kind. To the maximum extent permitted under applicable law, we, on our own behalf and on behalf of our affiliates and our respective licensors and service providers, expressly disclaims all warranties, whether express, implied, statutory or otherwise, with respect to the service, including all implied warranties of merchantability, fitness for a particular purpose, title and non-infringement, and warranties that may arise out of course of dealing, course of performance, usage or trade practice. Without limitation to the foregoing, we provide no warranty or undertaking, and make no representation of any kind that the service will meet your requirements, achieve any intended results, be compatible or work with any other software, websites, systems or services, operate without interruption, meet any performance or reliability standards or be error free or that any errors or defects can or will be corrected. Without limiting the foregoing, neither us nor any provider makes any representation or warranty of any kind, express or implied: (i) as to the operation or availability of the service, or the information, content, and materials or products included thereon; (ii) that the service will be uninterrupted or error-free; (iii) as to the accuracy, reliability, or currency of any information or content provided through the service; or (iv) that the service, its servers, the content, or e-mails sent from or on behalf of us are free of viruses, scripts, trojan horses, worms, malware, timebombs or other harmful components. Some jurisdictions do not allow the exclusion of or limitations on implied warranties or the limitations on the applicable statutory rights of a consumer, so some or all of the above exclusions and limitations may not apply to you."
      },
      "liabilityTerms": {
        "title": "Limitation of Liability",
        "content": "To the fullest extent permitted by applicable law, in no event will AROLARIU.RO be liable to you on any legal theory for any incidental, direct, indirect, punitive, actual, consequential, special, exemplary, or other damages, including without limitation, loss of revenue or income, lost profits, pain and suffering, emotional distress, cost of substitute goods or services, or similar damages suffered or incurred by you or any third party that arise in connection with the service (or the termination thereof for any reason), even if AROLARIU.RO has been advised of the possibility of such damages. AROLARIU.RO shall not be liable for any damages, liability or losses arising out of: (i) your use of or reliance on the service or your inability to access or use the service; or (ii) any transaction or relationship between you and any third party provider, even if AROLARIU.RO has been advised of the possibility of such damages. AROLARIU.RO shall not be liable for delay or failure in performance resulting from causes beyond AROLARIU.RO's reasonable control. You acknowledge that the service may be subject to limitations, delays, and other problems inherent in the use of the internet and electronic communications. AROLARIU.RO is not responsible for any delays, delivery failures, or other damage resulting from such problems. To the maximum extent permitted by applicable law, in no event shall we or our suppliers be liable for any special, incidental, indirect, or consequential damages whatsoever (including, but not limited to, damages for loss of profits, for loss of data or other information, for business interruption, for personal injury, for loss of privacy arising out of or in any way related to the use of or inability to use the service, third-party software and/or third-party hardware used with the service, or otherwise in connection with any provision of this Agreement), even if we or any supplier has been advised of the possibility of such damages and even if the remedy fails of its essential purpose. Some states/jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so the above limitation or exclusion may not apply to you."
      },
      "severabilityTerms": {
        "title": "Severability",
        "content": "If any provision of these Terms is held to be unenforceable or invalid, such provision will be changed and interpreted to accomplish the objectives of such provision to the greatest extent possible under applicable law and the remaining provisions will continue in full force and effect. This Agreement, together with the Privacy Policy and any other legal notices published by us on the Services, shall constitute the entire agreement between you and us concerning the Services. If any provision of this Agreement is deemed invalid by a court of competent jurisdiction, the invalidity of such provision shall not affect the validity of the remaining provisions of this Agreement, which shall remain in full force and effect. No waiver of any term of this Agreement shall be deemed a further or continuing waiver of such term or any other term, and our failure to assert any right or provision under this Agreement shall not constitute a waiver of such right or provision. YOU AND US AGREE THAT ANY CAUSE OF ACTION ARISING OUT OF OR RELATED TO THE SERVICES MUST COMMENCE WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES. OTHERWISE, SUCH CAUSE OF ACTION IS PERMANENTLY BARRED."
      },
      "waiverTerms": {
        "title": "Waiver",
        "content": "Except as provided herein, the failure to exercise a right or require performance of an obligation under this Agreement shall not affect a party's ability to exercise such right or require such performance at any time thereafter nor shall be the waiver of a breach constitute a waiver of any subsequent breach. No failure to exercise, and no delay in exercising, on the part of either party, any right or any power under this Agreement shall operate as a waiver of that right or power. Nor shall any single or partial exercise of any right or power under this Agreement preclude further exercise of that or any other right granted herein. In the event of a conflict between this Agreement and any applicable purchase or other terms, the terms of this Agreement shall govern."
      },
      "amendmentsTerms": {
        "title": "Amendments to Agreement",
        "content": "We reserve the right to modify, supplement or replace the terms of the Agreement, effective upon posting at www.arolariu.ro or notifying you otherwise. If you do not want to agree to changes to the Agreement, you can terminate the Agreement at any time per the terms herein. If a revision is material we will provide at least 30 days' notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion. By continuing to access or use our service after any revisions become effective, you agree to be bound by the revised terms. If you do not agree to the new terms, you are no longer authorized to use our service."
      },
      "entireAgreementTerms": {
        "title": "Entire Agreement",
        "content": "The Terms of Service constitute the entire agreement between you and AROLARIU.RO regarding your use of the service and supersede all prior and contemporaneous written or oral agreements between you and AROLARIU.RO. You may be subject to additional terms and conditions that apply when you use or purchase other AROLARIU.RO's services, which AROLARIU.RO will provide to you at the time of such use or purchase."
      },
      "arbitrateTerms": {
        "title": "Arbitration",
        "content": "This Agreement and any dispute or claim arising out of, or related to, it, its interpretation, or the breach, termination or validity thereof, the relationships which result from this Agreement, including the performance, breach, or validity of this Agreement, shall be governed by the laws of Romania. The exclusive jurisdiction and venue for any action under this Agreement shall be the courts located in Romania and you hereby submit to the personal jurisdiction of such courts. You hereby waive any right to a jury trial in any proceeding arising out of or related to this Agreement. The United Nations Convention on Contracts for the International Sale of Goods does not apply to this Agreement. The term “dispute” means any dispute, action, or other controversy between you and us concerning the Services or this agreement, whether in contract, warranty, tort, statute, regulation, ordinance, or any other legal or equitable basis. “Dispute” will be given the broadest possible meaning allowable under law."
      },
      "disputeNoticeTerms": {
        "title": "Notice of Dispute",
        "content": "In the event of a dispute, you or AROLARIU.RO must give the other a Notice of Dispute, which is a written statement that sets forth the name, address, and contact information of the party giving it, the facts giving rise to the dispute, and the relief requested. You must send any Notice of Dispute by email to: admin@arolariu.ro. AROLARIU.RO will send any Notice of Dispute to you by mail to your address if we have it, or otherwise to your email address. You and AROLARIU.RO will attempt to resolve any dispute through informal negotiation within sixty (60) days from the date the Notice of Dispute is sent. After sixty (60) days, you or AROLARIU.RO may commence arbitration."
      },
      "submissionsAndPrivacyTerms": {
        "title": "Submissions and Privacy",
        "content": "When you visit the website or send emails to us, you are communicating with us electronically. You consent to receive communications from us electronically. We will communicate with you by email or by posting notices on the website. You agree that all agreements, notices, disclosures, and other communications that we provide electronically satisfy any legal requirement that such communications be in writing. AROLARIU.RO may, but shall not be obligated to, monitor, review, or edit User Content. In all cases, AROLARIU.RO reserves the right to remove or disable access to any User Content for any or no reason, including but not limited to, User Content that, in AROLARIU.RO's sole discretion, violates the Agreements. AROLARIU.RO may take these actions without prior notification to you or any third party. Removal or disabling of access to User Content shall be at our sole discretion, and we do not promise to remove or disable access to any specific User Content. In the event that you submit or post any ideas, creative suggestions, designs, photographs, information, advertisements, data or proposals, including ideas for new or improved products, services, features, technologies or promotions, you expressly agree that such submissions will automatically be treated as non-confidential and non-proprietary and will become the sole property of us without any compensation or credit to you whatsoever. We and our affiliates shall have no obligations with respect to such submissions or posts and may use the ideas contained in such submissions or posts for any purposes in any medium in perpetuity, including, but not limited to, developing, manufacturing, and marketing products and services using such ideas."
      },
      "promotionTerms": {
        "title": "Promotions",
        "content": "We may, from time to time, include contests, promotions, sweepstakes, or other activities (“Promotions”) that require you to submit material or information concerning yourself. Please note that all Promotions may be governed by separate rules that may contain certain eligibility requirements, such as restrictions as to age and geographic location. You are responsible to read all Promotions rules to determine whether or not you are eligible to participate. If you enter any Promotion, you agree to abide by and to comply with all Promotions Rules. Additional terms and conditions may apply to purchases of goods or services on or through the Services, which terms and conditions are made a part of this Agreement by this reference. Any promotions made available through the service may be governed by rules that are separate from these Terms. If you participate in any promotions, please review the applicable rules as well as our Privacy Policy. If the rules for a promotion conflict with these Terms, the promotion rules will apply."
      },
      "typographyErrorsTerms": {
        "title": "Typography Errors",
        "content": "In the event that a AROLARIU.RO product is mistakenly listed at an incorrect price, AROLARIU.RO reserves the right to refuse or cancel any orders placed for the product listed at the incorrect price. AROLARIU.RO reserves the right to refuse or cancel any such orders whether or not the order has been confirmed and your credit card charged. If your credit card has already been charged for the purchase and your order is cancelled, AROLARIU.RO shall issue a credit to your credit card account in the amount of the incorrect price."
      },
      "miscellaneousTerms": {
        "title": "Miscellaneous",
        "content": "If for any reason a court of competent jurisdiction finds any provision or portion of these Terms & Conditions to be unenforceable, the remainder of these Terms & Conditions will continue in full force and effect. Any waiver of any provision of these Terms & Conditions will be effective only if in writing and signed by an authorized representative of us. We will be entitled to injunctive or other equitable relief (without the obligations of posting any bond or surety) in the event of any breach or anticipatory breach by you. We operate and control our Service from our offices in Romania. The Service is not intended for distribution to or use by any person or entity in any jurisdiction or country where such distribution or use would be contrary to law or regulation. Accordingly, those persons who choose to access our Service from other locations do so on their own initiative and are solely responsible for compliance with local laws, if and to the extent local laws are applicable. These Terms & Conditions (which include and incorporate our Privacy Policy) contains the entire understanding, and supersedes all prior understandings, between you and us concerning its subject matter, and cannot be changed or modified by you. The section headings used in this Agreement are for convenience only and will not be given any legal import. The failure of either party to exercise in any respect any right provided for herein shall not be deemed a waiver of any further rights hereunder. AROLARIU.RO shall not be liable for any failure to perform its obligations hereunder where such failure results from any cause"
      },
      "disclaimerTerms": {
        "title": "Disclaimer",
        "content": "To the maximum extent permitted by applicable law, we exclude all representations, warranties, and conditions relating to our website and the use of this website. We shall not be liable for any damages arising out of the use or inability to use the materials on AROLARIU.RO's website, even if AROLARIU.RO or an authorized representative of AROLARIU.RO has been notified, orally or in writing, of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you. We are not responsible for any content, code or any other imprecision. We do not provide warranties or guarantees. In no event shall we be liable for any special, direct, indirect, consequential, or incidental damages or any damages whatsoever, whether in an action of contract, negligence or other tort, arising out of or in connection with the use of the Service or the contents of the Service. We reserve the right to make additions, deletions, or modifications to the contents on the Service at any time without prior notice. Our Service and its contents are provided 'AS IS' and 'AS AVAILABLE' without any warranty or representations of any kind, whether express or implied. We are a distributor and not a publisher of the content supplied by third parties; as such, our exercises no editorial control over such content and makes no warranty or representation as to the accuracy, reliability or currency of any information, content, service or merchandise provided through or accessible via our Service. Without limiting the foregoing, We specifically disclaim all warranties and representations in any content transmitted on or in connection with our Service or on sites that may appear as links on our Service, or in the products provided as a part of, or otherwise in connection with, our Service, including without limitation any warranties of merchantability, fitness for a particular purpose or non-infringement of third party rights. No oral advice or written information given by us or any of its affiliates, employees, officers, directors, agents, or the like will create a warranty. Price and availability information is subject to change without notice. Without limiting the foregoing, we do not warrant that our Service will be uninterrupted, uncorrupted, timely, or error-free."
      }
    },
    "contactInformation": {
      "title": "Contact Information",
      "content": "If you have any questions about our Terms of Service, please contact us at admin@arolariu.ro"
    }
  },
  "privacyPolicy": {
    "title": "Privacy Policy",
    "last_updated": "Last updated: 2024-01-01",
    "terms": {}
  },
  "EULA": {
    "title": "End User License Agreement (EULA)",
    "content": "By using this website, you agree to the terms and conditions of the End User License Agreement (EULA).<br></br>Please read the following documents carefully before using the website:",
    "termsOfService": "Terms of Service",
    "privacyPolicy": "Privacy Policy",
    "accept": "Accept EULA",
    "cookiesPolicy": {
      "title": "Cookies Preference",
      "subtitle": "Manage your cookie settings. You can enable or disable different types of cookies below.",
      "cookies": {
        "cta": "Save cookies configuration",
        "essential": {
          "title": "Essential Cookies",
          "description": "Essential cookies are necessary for the website to function properly. <br> </br> This category only includes cookies that ensures basic functionalities and security features of the website.",
          "checkbox": "This option cannot be disabled. Essential cookies are always enabled."
        },
        "analytics": {
          "title": "Analytics Cookies",
          "description": "These cookies allow us to count visits and traffic sources, so we can measure and improve the performance of our site. <br></br> They help us know which pages are the most and least popular and see how visitors move around the site. <br></br> <em>All information these cookies collect is aggregated and therefore can be considered anonymous.</em>",
          "checkbox": "Enabling the analytics cookies to helps us to improve our website."
        }
      }
    }
  }
}
